# Predict titanic survival using Naive bayes

### Perform Exploratory Data analysis on titanic dataset

In [1]:
import pandas as pd
import sklearn as sk
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB

In [2]:
Train_dataframe = pd.read_csv("D:\DataSetfor MLandDL\\titanic\\train.csv")
Test_dataframe = pd.read_csv("D:\DataSetfor MLandDL\\titanic\\test.csv")

In [3]:
len(Test_dataframe)

418

In [4]:
len(Train_dataframe)

891

In [5]:
Train_dataframe.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
Test_dataframe.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

###### Merging Train and Test b/z b/w having the same Name of features and also having same number of feature
##### so don,t need to perform (explorartoy data analysis on it) explicity
##### so thats we mergining both of them

In [7]:
dataframe = pd.concat([Train_dataframe, Test_dataframe])

In [8]:
891+418

1309

In [9]:
#Total lenght must be : 891 + 418 = 1309

In [10]:
dataframe.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
len(dataframe)

1309

In [12]:
dataframe.shape

(1309, 12)



### Feature Extraction
### Some of the feature are not importan--> means they are not effect our result

In [13]:
dataframe.drop(['PassengerId','Name','SibSp','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
dataframe.head()

   Survived  Pclass     Sex   Age  Parch     Fare
0       0.0       3    male  22.0      0   7.2500
1       1.0       1  female  38.0      0  71.2833
2       1.0       3  female  26.0      0   7.9250
3       1.0       1  female  35.0      0  53.1000
4       0.0       3    male  35.0      0   8.0500

In [14]:
dataframe.shape

(1309, 6)

<!-- As we known that ML model only understand number
here we numerical feature as well as categorical feature
so convert categorical feature into numerical feature with help on(on-hot-encoding) -->

###### As we known that ML model only understand number 
###### here we have numerical feature as well as categorical feature
###### convert categorical fearture into numerical feature with help of (on-hot-encoding)

In [15]:

# inputs = dataframe.drop(['Survived'], axis='columns')

In [16]:
dataframe.shape

(1309, 6)

In [17]:
on_hot_endcode = pd.get_dummies(dataframe.Sex)
on_hot_endcode.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [18]:
# concatination on-hot-encoding to inputs dataframe

In [19]:
dataframe = pd.concat([dataframe, on_hot_endcode], axis= 'columns')
dataframe.head()

   Survived  Pclass     Sex   Age  Parch     Fare  female  male
0       0.0       3    male  22.0      0   7.2500       0     1
1       1.0       1  female  38.0      0  71.2833       1     0
2       1.0       3  female  26.0      0   7.9250       1     0
3       1.0       1  female  35.0      0  53.1000       1     0
4       0.0       3    male  35.0      0   8.0500       0     1

In [20]:
# As from the above dataframe --> seperated sex column into male and female column and also convert into categorical feature

# so we don,t need Sex column ,,I m going to drop (sex and female or male) --> b/z dummy column trape the theory
# we need only one column it is eighter male/female---> b/z one colum is enough to represent male vs female

In [21]:
dataframe.drop(['Sex', 'female'], axis='columns',inplace=True)
dataframe.head()

   Survived  Pclass   Age  Parch     Fare  male
0       0.0       3  22.0      0   7.2500     1
1       1.0       1  38.0      0  71.2833     0
2       1.0       3  26.0      0   7.9250     0
3       1.0       1  35.0      0  53.1000     0
4       0.0       3  35.0      0   8.0500     1

In [22]:
print(dataframe.info())
print(dataframe.shape)
print(dataframe.isnull().sum())
print(dataframe.isna().any())
print(dataframe.duplicated().sum())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    float64
 1   Pclass    1309 non-null   int64
 2   Age       1046 non-null   float64
 3   Parch     1309 non-null   int64
 4   Fare      1308 non-null   float64
 5   male      1309 non-null   uint8
dtypes: float64(3), int64(2), uint8(1)
memory usage: 62.6 KB
None
(1309, 6)
Survived    418
Pclass        0
Age         263
Parch         0
Fare          1
male          0
dtype: int64
Survived     True
Pclass      False
Age          True
Parch       False
Fare         True
male        False
dtype: bool
166

In [23]:
dataframe.columns[dataframe.isna().any()]

Index(['Survived', 'Age', 'Fare'], dtype='object')

In [24]:
dataframe.Age[:10]

#similarly we also check it Fare column

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

######  There are many ways to replace NaN or empyt cell
###### find mean or medain or mode(most frequent value and fill this empty or NaN cell

In [25]:
fill_by_mean_value = dataframe['Age'].mean()

In [26]:
fill_by_mean_value

29.881137667304014

In [27]:
# inputs =inputs.Age.fillna(inputs.Age.mean())
dataframe['Age'].fillna(fill_by_mean_value, inplace=True)

In [28]:
dataframe.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.881138
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [29]:
fill_by_mean_values = dataframe['Fare'].mean()

In [30]:
dataframe['Fare'].fillna(fill_by_mean_values, inplace=True)

In [31]:
# We remove all empty and NaN cell from our dataset Now we are able to trian ML model on these dataset

print(dataframe.info())
print(dataframe.shape)
print(dataframe.isnull().sum())
print(dataframe.isna().any())
print(dataframe.duplicated().sum())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    float64
 1   Pclass    1309 non-null   int64
 2   Age       1309 non-null   float64
 3   Parch     1309 non-null   int64
 4   Fare      1309 non-null   float64
 5   male      1309 non-null   uint8
dtypes: float64(3), int64(2), uint8(1)
memory usage: 62.6 KB
None
(1309, 6)
Survived    418
Pclass        0
Age           0
Parch         0
Fare          0
male          0
dtype: int64
Survived     True
Pclass      False
Age         False
Parch       False
Fare        False
male        False
dtype: bool
166

In [32]:
fill_by_mean_values = dataframe['Survived'].mode()[0]
dataframe['Survived'].fillna(fill_by_mean_values, inplace=True)

In [33]:
print(dataframe.info())
print(dataframe.shape)
print(dataframe.isnull().sum())
print(dataframe.isna().any())
print(dataframe.duplicated().sum())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  1309 non-null   float64
 1   Pclass    1309 non-null   int64
 2   Age       1309 non-null   float64
 3   Parch     1309 non-null   int64
 4   Fare      1309 non-null   float64
 5   male      1309 non-null   uint8
dtypes: float64(3), int64(2), uint8(1)
memory usage: 62.6 KB
None
(1309, 6)
Survived    0
Pclass      0
Age         0
Parch       0
Fare        0
male        0
dtype: int64
Survived    False
Pclass      False
Age         False
Parch       False
Fare        False
male        False
dtype: bool
222

# Train Naive Bayes

In [34]:
actual_class_label = dataframe.Survived

In [35]:

train_x, test_x, train_y, test_y = train_test_split(dataframe, actual_class_label, test_size=0.2)

In [36]:

train_x.shape

(1047, 6)

In [37]:
train_y.isna().sum()

0

In [38]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [39]:
model.fit(train_x,train_y)

GaussianNB()

In [40]:
model.score(test_x,test_y)

1.0

In [42]:
model.predict(test_x[0:10])

array([0., 0., 0., 1., 0., 0., 1., 0., 1., 0.])

In [44]:
# print the actual class label and compare it
test_y[0:10]

180    0.0
671    0.0
48     0.0
359    1.0
760    0.0
134    0.0
209    1.0
369    0.0
607    1.0
179    0.0
Name: Survived, dtype: float64

In [45]:
model.predict_proba(test_x[0:10])

array([[1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [1., 0.]])

## calculate score using cross validation

In [46]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(), train_x, train_y, cv=5)

array([1., 1., 1., 1., 1.])